Revit 2026 API

# FailureMessageAccessorCloneFailureMessage Method

---

Creates a copy of the FailureMessage.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureMessage CloneFailureMessage()
```
```vb
Public Function CloneFailureMessage As FailureMessage
```
```cpp
public:
FailureMessage^ CloneFailureMessage()
```
```fsharp
member CloneFailureMessage : unit -> FailureMessage
```

#### Return Value

FailureMessage Copy of the FailureMesassge.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

#### Reference

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace